Ran Plan for dir: `terraform/iam/testuser` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.7.0 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/Jongwook-Seong/terraform-provisioning/4/default/terraform/iam/testuser/iam::testuser-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::573644187329:role/atlantis-testuser-admin'" in "/home/atlantis/.atlantis/repos/Jongwook-Seong/terraform-provisioning/4/default/terraform/iam/testuser": exit status 1
data.terraform_remote_state.codedeploy: Reading...
data.terraform_remote_state.kms: Reading...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.secretsmanager: Reading...
data.terraform_remote_state.demo_jwsdapne2: Reading...
data.aws_iam_policy_document.jenkins_assume_role_document: Reading...
data.aws_iam_policy_document.jenkins_cloudwatch_document: Reading...
data.aws_iam_policy_document.demo_jwsdapne2_task_exec_policy: Reading...
data.aws_iam_policy_document.gitaction_assume_role_document: Reading...
data.aws_iam_policy_document.codebuild_starter_assume_role_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Reading...
data.aws_iam_policy_document.gitaction_s3: Reading...
data.aws_iam_policy_document.assume_id_admin_assume_role: Reading...
data.aws_iam_policy_document.demo_jwsdapne2_task_exec_policy: Read complete after 0s [id=3018809224]
data.aws_iam_policy_document.codebuild_starter_assume_role_document: Read complete after 0s [id=1229436035]
data.aws_iam_policy_document.gitaction_s3: Read complete after 0s [id=2892931668]
data.aws_iam_policy_document.jenkins_assume_role_document: Read complete after 0s [id=3361810881]
data.aws_iam_policy_document.jenkins_cloudwatch_document: Read complete after 0s [id=60798268]
data.aws_iam_policy_document.assume_id_admin_assume_role: Read complete after 0s [id=364819472]
data.aws_iam_policy_document.gitaction_assume_role_document: Read complete after 0s [id=114339170]
data.aws_iam_policy_document.codebuild_deployment_assume_role_document: Read complete after 0s [id=1229436035]
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Reading...
data.aws_iam_policy_document.jenkins_operation_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_ecr_document: Read complete after 0s [id=482158191]
data.aws_iam_policy_document.sumologic_s3_policy_document: Reading...
data.aws_iam_policy_document.codedeploy_deployment_assume_role_document: Reading...
data.aws_iam_policy_document.codebuild_deployment_cloudwatch_document: Read complete after 0s [id=2782058806]
data.aws_iam_policy_document.gitaction_ecr: Reading...
data.aws_iam_policy_document.codebuild_deployment_operation_document: Reading...
data.aws_iam_policy_document.assume_id_admin_pass_role: Reading...
data.aws_iam_policy_document.sumologic_s3_policy_document: Read complete after 0s [id=2899466539]
data.aws_iam_policy_document.jenkins_operation_document: Read complete after 0s [id=3914925036]
data.aws_iam_policy_document.codedeploy_deployment_assume_role_document: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.jenkins_universal_document: Reading...
data.aws_iam_policy_document.jenkins_ecr_document: Reading...
data.aws_iam_policy_document.gitaction_ecr: Read complete after 0s [id=1752591292]
data.aws_iam_policy_document.jenkins_ecr_document: Read complete after 0s [id=1543959488]
data.aws_iam_policy_document.demo_jwsdapne2_task_exec_assume_role_document: Reading...
data.aws_iam_policy_document.assume_id_admin_pass_role: Read complete after 0s [id=4184222603]
data.aws_iam_policy_document.demo_jwsdapne2_task_assume_role_document: Reading...
data.aws_iam_policy_document.jenkins_universal_document: Read complete after 0s [id=2262596718]
data.aws_iam_policy_document.demo_jwsdapne2_task_exec_assume_role_document: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.codebuild_deployment_operation_document: Read complete after 0s [id=2715550297]
data.aws_iam_policy_document.demo_jwsdapne2_task_assume_role_document: Read complete after 0s [id=278358623]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_group.devops_black will be created
  + resource "aws_iam_group" "devops_black" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "devops_black"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.devops_black will be created
  + resource "aws_iam_group_membership" "devops_black" {
      + group = "devops_black"
      + id    = (known after apply)
      + name  = "devops_black"
      + users = [
          + "testuser",
        ]
    }

  # aws_iam_group_policy_attachment.devops_black will be created
  + resource "aws_iam_group_policy_attachment" "devops_black" {
      + group      = "devops_black"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # aws_iam_instance_profile.app_demoapp will be created
  + resource "aws_iam_instance_profile" "app_demoapp" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "demoapp-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-demoapp"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.codebuild_deployment will be created
  + resource "aws_iam_instance_profile" "codebuild_deployment" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "codebuild-deployment-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "codebuild-deployment"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_instance_profile.jenkins will be created
  + resource "aws_iam_instance_profile" "jenkins" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "jenkins-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "app-jenkins"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_openid_connect_provider.gitaction_idp will be created
  + resource "aws_iam_openid_connect_provider" "gitaction_idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "ffffffffffffffffffffffffffffffffffffffff",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_policy.app_universal will be created
  + resource "aws_iam_policy" "app_universal" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "app-universal"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::jws-service-deployment/demoapp/*",
                        ]
                      + Sid      = "AllowAnsibleArtifactAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::jws-service-deployment",
                          + "arn:aws:s3:::jws-service-deployment/*",
                        ]
                      + Sid      = "AllowArtifactsReadAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeTags",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAnsibleCreateDescribeEc2TagsAccess"
                    },
                  + {
                      + Action   = [
                          + "ssm:UpdateInstanceInformation",
                          + "ssmmessages:CreateControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:OpenDataChannel",
                          + "ssm:ListAssociations",
                          + "ssm:ListInstanceAssociations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetEncryptionConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:AcknowledgeMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:FailMessage",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:GetMessages",
                          + "ec2messages:SendReply",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.sumologic_s3_policy will be created
  + resource "aws_iam_policy" "sumologic_s3_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Sumo Logic to receive s3 bucket logs"
      + id               = (known after apply)
      + name             = "sumologic-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucketVersions",
                          + "s3:ListBucket",
                          + "s3:GetObjectVersion",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::jwsdapne2-vpcflow-log/*",
                          + "arn:aws:s3:::jwsdapne2-vpcflow-log",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.app_demoapp will be created
  + resource "aws_iam_role" "app_demoapp" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-demoapp"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.assume_id_admin will be created
  + resource "aws_iam_role" "assume_id_admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::573644187329:user/testuser",
                              + "arn:aws:iam::573644187329:root",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 43200
      + name                  = "assume-id-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_deployment will be created
  + resource "aws_iam_role" "codebuild_deployment" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-deployment"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codebuild_starter will be created
  + resource "aws_iam_role" "codebuild_starter" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codebuild.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::573644187329:role/app-jenkins",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codebuild-starter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.codedeploy_deployment will be created
  + resource "aws_iam_role" "codedeploy_deployment" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codedeploy-deployment"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.demo_jwsdapne2_task will be created
  + resource "aws_iam_role" "demo_jwsdapne2_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:ap-northeast-2:573644187329:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "573644187329"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-jwsdapne2-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.demo_jwsdapne2_task_exec will be created
  + resource "aws_iam_role" "demo_jwsdapne2_task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-jwsdapne2-task-exec"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.gitaction will be created
  + resource "aws_iam_role" "gitaction" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:DevopsArtFactory/springboot-sample:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::573644187329:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gitaction"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.jenkins will be created
  + resource "aws_iam_role" "jenkins" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "s3.amazonaws.com",
                              + "ec2.amazonaws.com",
                              + "codebuild.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "app-jenkins"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.assume_id_admin_passrole will be created
  + resource "aws_iam_role_policy" "assume_id_admin_passrole" {
      + id          = (known after apply)
      + name        = "assume-id-admin-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_cloudwatch will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_cloudwatch" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:573644187329:log-group:/aws/codebuild/*:*",
                          + "arn:aws:logs:*:573644187329:log-group:/aws/codebuild/*",
                          + "arn:aws:logs:*:573644187329:log-group:/*:*:*",
                          + "arn:aws:logs:*:573644187329:log-group:/*:*",
                          + "arn:aws:logs:*:573644187329:log-group:/*",
                          + "arn:aws:logs:*:573644187329:log-group:*:*:*/*",
                        ]
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_ecr will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_ecr" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "sts:GetServiceBearerToken",
                          + "ecr:GetAuthorizationToken",
                          + "ecr-public:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_deployment_operation will be created
  + resource "aws_iam_role_policy" "codebuild_deployment_operation" {
      + id          = (known after apply)
      + name        = "codebuild-deployment-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:SendCommand",
                          + "ssm:ListCommandInvocations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SSMSendCommand"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudwatchAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentELBAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentIAMAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:573644187329:network-interface/*"
                    },
                  + {
                      + Action   = [
                          + "ec2:ModifyLaunchTemplate",
                          + "ec2:GetLaunchTemplateData",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplateVersions",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateLaunchTemplateVersion",
                          + "ec2:CreateLaunchTemplate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "LaunchTemplates"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVPCAccess"
                    },
                  + {
                      + Action   = "autoscaling:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentASGAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVolume*",
                          + "ec2:DeleteVolume",
                          + "ec2:CreateVolume",
                          + "ec2:AttachVolume",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentVolumeAccess"
                    },
                  + {
                      + Action   = "ec2:DescribeKeyPairs"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentKeyPairAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:StartInstances",
                          + "ec2:RunInstances",
                          + "ec2:RebootInstances",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeInstances",
                          + "ec2:CreateTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentInstanceAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeSnapshots",
                          + "ec2:CreateSnapshot",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSnapshotAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RegisterImage",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentAMIAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "DeploymentSecurityGroupAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.codebuild_starter will be created
  + resource "aws_iam_role_policy" "codebuild_starter" {
      + id          = (known after apply)
      + name        = "codebuild-starter"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:GetLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:*:*:log-group:/aws/codebuild/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "codebuild:StartBuild",
                          + "codebuild:BatchGetBuilds",
                          + "codebuild:BatchGetProjects",
                          + "codebuild:StopBuild",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:codebuild:*:*:*",
                        ]
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.demo_jwsdapne2_task_exec_policy will be created
  + resource "aws_iam_role_policy" "demo_jwsdapne2_task_exec_policy" {
      + id          = (known after apply)
      + name        = "task_exec_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Log"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.gitaction_ecr will be created
  + resource "aws_iam_role_policy" "gitaction_ecr" {
      + id          = (known after apply)
      + name        = "gitaction-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.gitaction_s3 will be created
  + resource "aws_iam_role_policy" "gitaction_s3" {
      + id          = (known after apply)
      + name        = "gitaction-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAccessS3Bucket"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_cloudwatch will be created
  + resource "aws_iam_role_policy" "jenkins_cloudwatch" {
      + id          = (known after apply)
      + name        = "jenkins-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowCloudWatchAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_ecr will be created
  + resource "aws_iam_role_policy" "jenkins_ecr" {
      + id          = (known after apply)
      + name        = "jenkins-ecr"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadECRAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ap-northeast-2:573644187329:repository/*"
                      + Sid      = "AllowReadAnotherAccountECRAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_operation will be created
  + resource "aws_iam_role_policy" "jenkins_operation" {
      + id          = (known after apply)
      + name        = "jenkins-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "ec2:TerminateInstances",
                          + "ec2:StopInstances",
                          + "ec2:RunInstances",
                          + "ec2:RequestSpotInstances",
                          + "ec2:RegisterImage",
                          + "ec2:ModifySnapshotAttribute",
                          + "ec2:ModifyInstanceAttribute",
                          + "ec2:ModifyImageAttribute",
                          + "ec2:GetPasswordData",
                          + "ec2:DetachVolume",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeVpcEndpoints",
                          + "ec2:DescribeVpcEndpointServices",
                          + "ec2:DescribeVpcEndpointServicePermissions",
                          + "ec2:DescribeVpcEndpointServiceConfigurations",
                          + "ec2:DescribeVpcEndpointConnections",
                          + "ec2:DescribeVpcEndpointConnectionNotifications",
                          + "ec2:DescribeVpcClassicLinkDnsSupport",
                          + "ec2:DescribeVpcClassicLink",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSpotPriceHistory",
                          + "ec2:DescribeSpotInstanceRequests",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribePlacementGroups",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceAttribute",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeImageAttribute",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeregisterImage",
                          + "ec2:DeleteVolume",
                          + "ec2:DeleteSnapshot",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:DeleteKeyPair",
                          + "ec2:CreateVolume",
                          + "ec2:CreateTags",
                          + "ec2:CreateSnapshot",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:CreateKeypair",
                          + "ec2:CreateImage",
                          + "ec2:CopyImage",
                          + "ec2:CancelSpotInstanceRequests",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AttachVolume",
                          + "codebuild:*",
                          + "autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "SecurityGroupAccess"
                    },
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetAuthTokenAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.jenkins_universal will be created
  + resource "aws_iam_role_policy" "jenkins_universal" {
      + id          = (known after apply)
      + name        = "jenkins-universal"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:DescribeTags"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowAnsibleDescribeEc2TagsAccess"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeDhcpOptions",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowVPCAccess"
                    },
                  + {
                      + Action   = "ec2:CreateNetworkInterfacePermission"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:ap-northeast-2:573644187329:network-interface/*"
                      + Sid      = "AllowEC2NetworkAccess"
                    },
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                          + "ssm:UpdateInstanceInformation",
                          + "ssm:TerminateSession",
                          + "ssm:StartSession",
                          + "ssm:ResumeSession",
                          + "ssm:DescribeSessions",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSSMAccess"
                    },
                  + {
                      + Action   = [
                          + "elasticfilesystem:DescribeMountTargets",
                          + "elasticfilesystem:DescribeFileSystems",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEFSAccess"
                    },
                  + {
                      + Action   = "s3:GetEncryptionConfiguration"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowGetEncryptionConfiguration"
                    },
                  + {
                      + Action   = [
                          + "ec2messages:SendReply",
                          + "ec2messages:GetMessages",
                          + "ec2messages:GetEndpoint",
                          + "ec2messages:FailMessage",
                          + "ec2messages:DeleteMessage",
                          + "ec2messages:AcknowledgeMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowEC2MessagesPermission"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.assume_id_admin will be created
  + resource "aws_iam_role_policy_attachment" "assume_id_admin" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.demoapp_attach will be created
  + resource "aws_iam_role_policy_attachment" "demoapp_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-demoapp"
    }

  # aws_iam_role_policy_attachment.ecs_managed_policy_codedeploy_deployment will be created
  + resource "aws_iam_role_policy_attachment" "ecs_managed_policy_codedeploy_deployment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = (known after apply)
    }

  # aws_iam_role_policy_attachment.jenkins_attach will be created
  + resource "aws_iam_role_policy_attachment" "jenkins_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "app-jenkins"
    }

  # aws_iam_user.testuser will be created
  + resource "aws_iam_user" "testuser" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "testuser"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.sops_testuser.aws_iam_role.common will be created
  + resource "aws_iam_role" "common" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::573644187329:root",
                              + "arn:aws:iam::573644187329:role/atlantis-ecs_task_execution",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "testuser-sops"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sops_testuser.aws_iam_role.secure will be created
  + resource "aws_iam_role" "secure" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::573644187329:root",
                              + "arn:aws:iam::573644187329:role/atlantis-ecs_task_execution",
                            ]
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "testuser-secure-sops"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.sops_testuser.aws_iam_role_policy.common-passrole will be created
  + resource "aws_iam_role_policy" "common-passrole" {
      + id          = (known after apply)
      + name        = "testuser-sops-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowIAMPassRole"
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

  # module.sops_testuser.aws_iam_role_policy.secure-passrole will be created
  + resource "aws_iam_role_policy" "secure-passrole" {
      + id          = (known after apply)
      + name        = "testuser-secure-sops-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowIAMPassRole"
                    },
                ]
            }
        )
      + role        = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_demoapp_instance_profile          = (known after apply)
  + codebuild_deployment_arn              = (known after apply)
  + codebuild_deployment_instance_profile = (known after apply)
  + codedeploy_deployment_arn             = (known after apply)
  + demo_jwsdapne2_task_arn               = (known after apply)
  + demo_jwsdapne2_task_exec_arn          = (known after apply)
  + gitaction_arn                         = (known after apply)
  + jenkins_arn                           = (known after apply)
  + jenkins_instance_profile              = (known after apply)
  + sops_testuser_common_role_arn         = (known after apply)
  + sops_testuser_secure_role_arn         = (known after apply)

Error: Unable to find remote state

  with data.terraform_remote_state.kms,
  on remote_state.tf line 1, in data "terraform_remote_state" "kms":
   1: data "terraform_remote_state" "kms" {

No stored state was found for the given workspace in the given backend.

Error: Unable to find remote state

  with data.terraform_remote_state.secretsmanager,
  on remote_state.tf line 7, in data "terraform_remote_state" "secretsmanager":
   7: data "terraform_remote_state" "secretsmanager" {

No stored state was found for the given workspace in the given backend.

Error: Unable to find remote state

  with data.terraform_remote_state.demo_jwsdapne2,
  on remote_state.tf line 14, in data "terraform_remote_state" "demo_jwsdapne2":
  14: data "terraform_remote_state" "demo_jwsdapne2" {

No stored state was found for the given workspace in the given backend.

Error: Unable to find remote state

  with data.terraform_remote_state.codedeploy,
  on remote_state.tf line 21, in data "terraform_remote_state" "codedeploy":
  21: data "terraform_remote_state" "codedeploy" {

No stored state was found for the given workspace in the given backend.

Error: Unable to find remote state

  with data.terraform_remote_state.eks,
  on remote_state.tf line 27, in data "terraform_remote_state" "eks":
  27: data "terraform_remote_state" "eks" {

No stored state was found for the given workspace in the given backend.

Error: Unsupported attribute

  on role_DatadogAWSIntegrationRole.tf line 10, in resource "aws_iam_role" "DatadogAWSIntegrationRole":
  10:           "AWS" : "arn:aws:iam::${var.account_id.datadog}:root"
    ├────────────────
    │ var.account_id is object with 2 attributes

This object does not have an attribute named "datadog".

Error: Unsupported attribute

  on role_sumologic-role.tf line 12, in data "aws_iam_policy_document" "sumologic_assume_role_policy":
  12:       identifiers = ["arn:aws:iam::${var.account_id.sumologic}:root"]
    ├────────────────
    │ var.account_id is object with 2 attributes

This object does not have an attribute named "sumologic".

```
</details>

